In [1]:
# _*_ coding:utf-8 _*_
import tushare as ts
import pandas as pd
import matplotlib.pylab as plt
import seaborn as sns
import numpy as np
import pymysql
import datetime
from retry import retry
%matplotlib inline

#connect mysql
from sqlalchemy import create_engine
engine = create_engine('mysql+pymysql://root:caicai520@127.0.0.1'
                       '/quantist?charset=utf8')

In [3]:
today_all = ts.get_today_all()
today_all[0:3]

[Getting data:]

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

#

<div>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>code</th>
      <th>name</th>
      <th>changepercent</th>
      <th>trade</th>
      <th>open</th>
      <th>high</th>
      <th>low</th>
      <th>settlement</th>
      <th>volume</th>
      <th>turnoverratio</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>603619</td>
      <td>N中曼</td>
      <td>44.007</td>
      <td>32.56</td>
      <td>32.56</td>
      <td>32.56</td>
      <td>32.56</td>
      <td>22.61</td>
      <td>26466</td>
      <td>0.06616</td>
    </tr>
    <tr>
      <th>1</th>
      <td>600933</td>
      <td>N爱柯迪</td>
      <td>43.960</td>
      <td>15.85</td>
      <td>13.21</td>
      <td>15.85</td>
      <td>13.21</td>
      <td>11.01</td>
      <td>68420</td>
      <td>0.04949</td>
    </tr>
    <tr>
      <th>2</th>
      <td>002619</td>
      <td>艾格拉斯</td>
      <td>10.047</td>
      <td>7.01</td>
      <td>7.01</td>
      <td>7.01</td>
      <td>6.56</td>
      <td>6.37</td>
      <td>11764653</td>
      <td>1.93247</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
%%time

good3 = []
for s in today_all['code']:
    #if (str(today_all['open']) < str(20) or str(today_all['volume']) > str(100000000)):
    if (str(today_all['volume']) > str(100000000)):
        good3.append(s)
print(len(good3))

0
CPU times: user 4.18 s, sys: 88 ms, total: 4.27 s
Wall time: 4.37 s

In [14]:
volume = today_all['volume']
print(volume[:3])
print(type(volume[:3]))

0       26466
1       68420
2    11764653
Name: volume, dtype: int64
<class 'pandas.core.series.Series'>

In [21]:
sql = 'select distinct code,open,volume from today_all where volume>100000000 and open<20'
data = pd.read_sql_query(sql,engine)
print(len(data))
print(data[:3])
good3 = data['code']
print(len(good3),type(good3))

52
     code   open      volume
0  600807  11.75   178729013
1  002185   8.39   144355090
2  000725   5.84  1764238402
52 <class 'pandas.core.series.Series'>

In [19]:
sql2 = 'alter table t_good add good3 varchar(10)'
sql3 = ''

In [23]:
sql = 'select distinct code from today_all where open<20'
data = pd.read_sql_query(sql,engine)
print(len(data))
print(data[:3])
good4 = data['code']
print(len(good4),type(good4))

2143
     code
0  603289
1  300708
2  300220
2143 <class 'pandas.core.series.Series'>

In [24]:
sql = 'select distinct code from today_all where volume>100000000'
data = pd.read_sql_query(sql,engine)
print(len(data))
print(data[:3])
good5 = data['code']
print(len(good5),type(good5))

44
     code
0  600807
1  002185
2  000725
44 <class 'pandas.core.series.Series'>

In [25]:
sql = 'select distinct code from today_all where open>20'
data = pd.read_sql_query(sql,engine)
print(len(data))
print(data[:3])
good5 = data['code']
print(len(good5),type(good5))

1027
     code
0  603659
1  603929
2  002893
1027 <class 'pandas.core.series.Series'>

In [26]:
sql = 'select distinct code from today_all'
data = pd.read_sql_query(sql,engine)
print(len(data))
print(data[:3])
good6 = data['code']
print(len(good6),type(good6))

3130
     code
0  603659
1  603289
2  300708
3130 <class 'pandas.core.series.Series'>

In [27]:
sql = 'select distinct code from today_all where volume<100000000'
data = pd.read_sql_query(sql,engine)
print(len(data))
print(data[:3])
good5 = data['code']
print(len(good5),type(good5))

3108
     code
0  603659
1  603289
2  300708
3108 <class 'pandas.core.series.Series'>